package ATM;

public class Main {
	/* 메뉴
	 * 1. 통장개설
	 * 2. 통장거래
	 * 3. 프로그램 종료 
	 * 메뉴 선택 : 1
	 * --------------
	 * 통장개설 메뉴
	 * 1. 통장 개설
	 * 2. 통장 해지
	 * 3. 이전으로
	 * 메뉴 선택 : 1
	 * -----------------
	 * 통장 이름 : 가
	 * 비밀번호 : 1234
	 * --------------
	 * 통장이 개설되었습니다
	 * --------------
	 * 통장개설 메뉴
	 * 1. 통장 개설
	 * 2. 통장 삭제
	 * 3. 이전으로
	 * -----------------
	 * 메뉴 선택 : 2
	 * -----------------
	 * 통장 이름 : 가
	 * 비밀번호 : 1234
	 * -----------------
	 * 통장이 해지되었습니다
	 * -----------------
	 * 통장개설 메뉴
	 * 1. 통장 개설
	 * 2. 통장 삭제
	 * 3. 이전으로
	 * -----------------
	 * 메뉴 선택 : 3
	 * -----------------
	 * 이전 메뉴로 돌아갑니다
	 * -----------------
	 * 1. 통장개설
	 * 2. 통장거래
	 * 3. 프로그램 종료 
	 * 메뉴 선택 : 2
	 * --------------
	 * 통장 이름 : 가
	 * 비밀번호 : 1234
	 * --------------
	 * 통장거래 메뉴
	 * 1. 입금
	 * 2. 출금
	 * 3. 통장거래내역
	 * 4. 이전 메뉴
	 *  메뉴 선택 : 1
	 * --------------
	 * 거래자 : 나
	 * 금액 : 100000
	 * --------------
	 * 입금되었습니다.
	 * 현재 금액 : 10000
	 * --------------
	 * 통장거래 메뉴
	 * 통장거래 메뉴
	 * 1. 입금
	 * 2. 출금
	 * 3. 통장거래내역
	 * 4. 이전 메뉴
	 *  메뉴 선택 : 2
	 * --------------
	 * 거래자 : 나
	 * 금액 : 10000
	 * --------------
	 * 현재 금액 : 90000
	 * --------------
	 * 통장거래 메뉴
	 * 1. 입금
	 * 2. 출금
	 * 3. 통장거래내역
	 * 4. 이전 메뉴
	 * 메뉴 선택 : 3
	 * --------------
	 * 비밀번호 : 1234
	 * --------------
	 * 1.날짜 :  거래자 : 나, 입출금 : 입금, 금액 : 100000, 현재금액 : 100000
	 * 2. 거래자 : 나, 입출금 : 출금, 금액 : 10000, 현재금액 : 90000
	 * 3. 거래자 : 나, 입출금 : 출금, 금액 : 10000, 현재금액 : 80000
	 * --------------
	 * 통장거래 메뉴
	 * 통장거래 메뉴
	 * 1. 입금
	 * 2. 출금
	 * 3. 통장거래내역
	 * 4. 이전 메뉴
	 * 메뉴 선택 : 4
	 * --------------
	 * 이전 메뉴로 돌아갑니다
	 * --------------
	 * * 메뉴
	 * 1. 통장개설
	 * 2. 통장거래
	 * 3. 프로그램 종료 
	 * 메뉴 선택 : 3
	 * --------------
	 * 프로그램을 종료함니다.
	 * --------------
	 */
	//자료 day18.MainEx03
	public static void main(String[] args) {
		
		

	}

}
