package ATM;

public class Main {
	/* 메뉴
	 * 1. 통장거래
	 * 2. 통장거래내역
	 * 3. 프로그램 종료 
	 * 메뉴 선택 : 1
	 * --------------
	 * 통장 이름 : 가
	 * --------------
	 * 1. 입금
	 * 2. 출금
	 * 3. 계좌이체
	 * 4. 이전 메뉴
	 *  메뉴 선택 : 1
	 * --------------
	 * 거래자 : 나
	 * 입금 금액 : 100000
	 * --------------
	 * 현재 금액 : 10000
	 * --------------
	 * 1. 입금
	 * 2. 출금
	 * 3. 계좌이체
	 * 4. 이전 메뉴
	 *  메뉴 선택 : 2
	 * --------------
	 * 거래자 : 나
	 * 입금 금액 : 10000
	 * --------------
	 * 현재 금액 : 90000
	 * --------------
	 * 1. 입금
	 * 2. 출금
	 * 3. 계좌이체
	 * 4. 이전 메뉴
	 *  메뉴 선택 : 3
	 * --------------
	 * 보내는 사람 : 나
	 * 받는 사람 : 다
	 * 금액 : 10000
	 * --------------
	 * 현재 금액 : 90000
	 * --------------
	 * 1. 입금
	 * 2. 출금
	 * 3. 계좌이체
	 * 4. 이전 메뉴
	 *  메뉴 선택 : 4
	 * --------------
	 * 이전 메뉴로 돌아갑니다
	 * --------------
	 * 메뉴
	 * 1. 통장거래
	 * 2. 통장거래내역
	 * 3. 프로그램 종료 
	 * 메뉴 선택 : 2
	 * --------------
	 *  통장 이름 : 가
	 * --------------
	 * 1. 거래자 : 나, 입출금 : 입금, 금액 : 100000, 현재금액 : 100000
	 * 2. 거래자 : 나, 입출금 : 출금, 금액 : 10000, 현재금액 : 90000
	 * 3. 거래자 : 나, 입출금 : 출금, 금액 : 10000, 현재금액 : 80000
	 * --------------
	 * * 메뉴
	 * 1. 통장거래
	 * 2. 통장거래내역
	 * 3. 프로그램 종료 
	 * 메뉴 선택 : 3
	 * --------------
	 * 프로그램을 종료함니다.
	 * --------------
	 */
	//자료 day18.MainEx03
	public static void main(String[] args) {
		
		

	}

}
